app/controllers/cats_controller.rb

    def create
        @cat = Cat.new(cat_params)
        if @cat.save!
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat = Cat.find_by(id: params[:id])

        if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "sex" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "yellow"], ["description", "        CUTE CAT\r\n    "], ["sex", "F"], ["updated_at", "2020-07-16 21:48:42.295934"], ["id", 2]]